In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

# Arithmetic

`select` statement can perform arithmetic.

## Arithmetic in Select Expressions

In a select expression, column names evaluate to row values. Arithmetic expressions can combine row values and constants together to create new values. 

Here is an example based on chairlifts in ski resorts. 

Every `lift` chair has a `number`.

It also has the number of `single` riders and `couple` riders.

In [2]:
%%sql

create table lift as
    select 101 as chair, 2 as single, 2 as couple union
    select 102         , 0          , 3           union
    select 103         , 4          , 1;

 * sqlite://
Done.

[]

Let's say we want to see the total number of people on each chair. We can write the following,

In [3]:
%%sql
select chair, single + 2 * couple as total from lift;

 * sqlite://
Done.

[(101, 6), (102, 6), (103, 6)]

## Discussion Question

Given the table `ints` that describes how to sum powers of 2 to form various integers,

In [13]:
%%sql
create table ints as
    select "zero" as word, 0 as one, 0 as two, 0 as four, 0 as eight union
    select "one", 1, 0, 0, 0 union
    select "two", 0, 2, 0, 0 union
    select "three", 1, 2, 0, 0 union
    select "four", 0, 0, 4, 0 union
    select "five", 1, 0, 4, 0 union
    select "six", 0, 2, 4, 0 union
    select "seven", 1, 2, 4, 0 union
    select "eight", 0, 0, 0, 8 union
    select "nine", 1, 0, 0, 8;

 * sqlite://
(sqlite3.OperationalError) table ints already exists
[SQL: create table ints as
    select "zero" as word, 0 as one, 0 as two, 0 as four, 0 as eight union
    select "one", 1, 0, 0, 0 union
    select "two", 0, 2, 0, 0 union
    select "three", 1, 2, 0, 0 union
    select "four", 0, 0, 4, 0 union
    select "five", 1, 0, 4, 0 union
    select "six", 0, 2, 4, 0 union
    select "seven", 1, 2, 4, 0 union
    select "eight", 0, 0, 0, 8 union
    select "nine", 1, 0, 0, 8;]
(Background on this error at: http://sqlalche.me/e/e3q8)

From the table above, we see that each positive integer can be expressed as a sum of powers of 2. On top of that, there's only one way to do so for each integer. For example, we can make `"seven"` by adding `1 + 2 + 4`.

#### A) Write a select statement for a two-column table of the `word` and `value` for each integer

The output should look like the following,

<img src = 'a.png' width = 400/>

In [14]:
%%sql
select word, one + two + four + eight as value from ints order by value;

 * sqlite://
Done.

[('zero', 0),
 ('one', 1),
 ('two', 1),
 ('three', 3),
 ('four', 4),
 ('five', 5),
 ('six', 6),
 ('seven', 7),
 ('eight', 8),
 ('nine', 9)]

#### B) Write a select statement for the `word` names of the powers of two

The output should look like the following,

<img src = 'b.png' width = 150/>

`5` and `7` are not included because they're not the powers of 2.

In [ ]:
%% sql